# include <iostream>

int main() {
  std::cout << "Проверка деления без остатка!\n";
  std::cout << "-------------------------\n";

  int x;
  int y;

  std::cout << "Введите первое число (делимое): ";
  std::cin >> x;
  std::cout << "Введите второе число (делитель): ";
  std::cin >> y;
  std::cout << "----Проверяем----\n";

  if (y == 0) { 
    std::cout << "Не забывай на ноль делить нельзя!";
  } else if (x % y == 0) {
  std::cout << "Да! " << x << " делится на " << y << " без остатка!";
  } else {
    std::cout << "Нет! " << x << " не делится на " << y << " без остатка!";
  }
}