#include <iostream>

int main() {
  std::cout << "Ознакомьтесь с меню ресторана на любой день недели по одной кнопке!!!\n";
  std::cout << "*****************************************\n";
  
  int dayOfTheWeek;
  
  std::cout << "Введите день недели (от 1 до 7), чтобы узнать меню бизнес-ланча: ";
  std::cin >> dayOfTheWeek;
  std::cout << "==========  Меню дня!!! ===========\n";

  if (dayOfTheWeek == 1) {
    std::cout << "Понедельник.\n";
    std::cout << "------------\n";
    std::cout << "Cалат: Оливье с ветчиной индейки - 120 гр.\n";
    std::cout << "Суп: Грибной - 250 гр.\n";
    std::cout << "Горячее: Рыба с томатом, запеченная под сыром - 150 гр.\n";
    std::cout << "Гарнир: Гречка отварная - 120 гр.\n";
    std::cout << "Компот/морс/чай - 300 мл.\n"; 
  } else if (dayOfTheWeek == 2) {
    std::cout << "Вторник.\n";
    std::cout << "------------\n";
    std::cout << "Cалат: Сельдь под шубой - 120 гр.\n";
    std::cout << "Суп: Минестроне - 250 гр.\n";
    std::cout << "Горячее: Котлеты из говядины - 150 гр.\n";
    std::cout << "Гарнир: Пюре картофельное - 120 гр.\n";
    std::cout << "Компот/морс/чай - 300 мл.\n"; 
  } else if (dayOfTheWeek == 3) {
    std::cout << "Среда.\n";
    std::cout << "------------\n";
    std::cout << "Cалат: Весенний - 120 гр.\n";
    std::cout << "Суп: Щи из квашенной капусты - 250 гр.\n";
    std::cout << "Горячее: Куринный шницель - 150 гр.\n";
    std::cout << "Гарнир: Рис отварной - 120 гр.\n";
    std::cout << "Компот/морс/чай - 300 мл.\n"; 
  } else if (dayOfTheWeek == 4) {
    std::cout << "Четверг.\n";
    std::cout << "------------\n";
    std::cout << "Cалат: Весенний - 120 гр.\n";
    std::cout << "Суп: Щи из квашенной капусты - 250 гр.\n";
    std::cout << "Горячее: Куринный шницель - 150 гр.\n";
    std::cout << "Гарнир: Рис отварной - 120 гр.\n";
    std::cout << "Компот/морс/чай - 300 мл.\n"; 
  } else if (dayOfTheWeek == 5) {
    std::cout << "Пятница.\n";
    std::cout << "------------\n";
    std::cout << "Cалат: Мимоза - 120 гр.\n";
    std::cout << "Суп: Лапша с курицей - 250 гр.\n";
    std::cout << "Горячее: Мясные тефтели в томатном соусе - 150 гр.\n";
    std::cout << "Гарнир: Овощное асорти - 120 гр.\n";
    std::cout << "Компот/морс/чай - 300 мл.\n"; 
  } else {
    std::cout << "Ой ой ой!!! Извините, но по субботам и воскресеньям бизнес-ланчей нет! Используйте, пожалуйста, постоянное меню.\n";
  }
  std::cout << "*****************************************\n";
}