#include <iostream>

int main() {
  std::cout << "**** Расчет налогов от дохода ****\n";
  std::cout << "----------------------------------\n";

  int income;
  int taxTotal;

  std::cout << "Введите сумму Вашего дохода за отчетный период ";
  std::cin >> income;
  std::cout << "----------------------------------\n"; 
  
  if (income < 0) {
     std::cout << "Неверная запись!\n" << "Доход не может быть отрицательным!\n";
  } else if (income == 0) {
    std::cout << "За отчетный период уплачивать налоги не требуется!\n";
  } else if (income > 50000) {
    taxTotal = ((income - 50000) * 30/100) + ((50000 - 10000) * 20/100) + 10000 * 13/100;
    std::cout << "Сумма уплаты необходимого налога за отчетный период " << taxTotal << " руб.";
  } else if (income <= 10000) {
      taxTotal = income * 13/100;
      std::cout << "Сумма уплаты необходимого налога за отчетный период " << taxTotal << " руб.";
  } else {
    taxTotal = ((income - 10000) * 20/100) + 10000 * 13/100;
    std::cout << "Сумма уплаты необходимого налога за отчетный период " << taxTotal << " руб.";
  }
  
}