#include <iostream>

int main() {

  std::cout << "**********************************\n";
  std::cout << "Расчет денежных средст в банкомате\n";
  std::cout << "**********************************\n";

  int money;

  std::cout << "Введите сумму денежных средств к выдаче ";
  std::cin >> money;
  std::cout << "-------------------------------------\n";
  std::cout << "Проверка\n";
  std::cout << "-------------------------------------\n";

  if (money <= 100000) {
    if (money % 100 == 0) {
      std::cout << "Выдача доступна!";
    } else {
      std::cout << "Выдача недоступна! Введена некорректная сумма!";
    }
  } else {
    std::cout << "Выдача недоступна! Введена некорректная сумма!";
  }
}